Revit 2026 API

# ScheduleFilterSetValue(String) Method

---

Set the filter value to a string.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetValue(
	string string
)
```
```vb
Public Sub SetValue (
	string As String
)
```
```cpp
public:
void SetValue(
	String^ string
)
```
```fsharp
member SetValue :
        string : string -> unit
```

#### Parameters

string String
     The filter value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ScheduleFilter Class

SetValue Overload

Autodesk.Revit.DB Namespace